group1 = ["Иванов", "Петров", "Сидоров", "Кузнецов", "Смирнов", "Попов", "Соколов", "Лебедев", "Козлов", "Новиков"]
group2 = ["Федоров", "Морозов", "Волков", "Алексеев", "Михайлов", "Макаров", "Крылов", "Семенов", "Тарасов", "Белов"]

team = tuple(group1[:5] + group2[:5])

print("Группа 1:", group1)
print("Группа 2:", group2)
print("Спортивная команда:", team)

print("Длина команды:", len(team))

sorted_team = tuple(sorted(team))
print("Отсортированная команда:", sorted_team)

count_ivanov = team.count("Иванов")
print("Фамилия 'Иванов' входит в команду?" , "Да" if count_ivanov > 0 else "Нет")
print("Количество фамилий 'Иванов' в команде:", count_ivanov)
